[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=64
subdivisions=16
width=416
height=416
channels=3
momentum=0.949
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.000125
burn_in=8000
max_batches = 86100
policy=cosine

mosaic=1

### CONV1 - 1 (1)
# conv1
[convolutional]
filters=40	#32
size=3
pad=1
stride=2
batch_normalize=1
activation=relu6


### CONV2 - MBConv1 - 1 (2)
# conv2_1_expand
[convolutional]
filters=40	#32
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv2_1_dwise
[convolutional]
groups=40	#32
filters=40	#32
size=3
stride=1
pad=1
batch_normalize=1
activation=relu6

# conv2_1_linear
[convolutional]
filters=16	#16
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


### CONV2 - MBConv1 - 2 (2)
# conv2_1_expand
[convolutional]
filters=40	#32
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv2_1_dwise
[convolutional]
groups=40	#32
filters=40	#32
size=3
stride=1
pad=1
batch_normalize=1
activation=relu6

# conv2_1_linear
[convolutional]
filters=16	#16
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


### CONV3 - MBConv6 - 1 (3)
# dropout only before residual connection
[dropout]
probability=.3

# block_3_1
[shortcut]
from=-5
activation=linear

# conv2_2_expand
[convolutional]
filters=112	#96
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv2_2_dwise
[convolutional]
groups=112	#96
filters=112	#96
size=3
pad=1
stride=2
batch_normalize=1
activation=relu6

# conv2_2_linear
[convolutional]
filters=32	#24
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


### CONV3 - MBConv6 - 2 (3)
# conv3_1_expand
[convolutional]
filters=176	#144
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv3_1_dwise
[convolutional]
groups=176	#144
filters=176	#144
size=3
stride=1
pad=1
batch_normalize=1
activation=relu6

# conv3_1_linear
[convolutional]
filters=32	#24
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


### CONV3 - MBConv6 - 3 (3)
# dropout only before residual connection
[dropout]
probability=.3

# block_3_1
[shortcut]
from=-5
activation=linear

# conv3_1_expand
[convolutional]
filters=176	#144
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv3_1_dwise
[convolutional]
groups=176	#144
filters=176	#144
size=3
stride=1
pad=1
batch_normalize=1
activation=relu6

# conv3_1_linear
[convolutional]
filters=32	#24
size=1
stride=1
pad=0
batch_normalize=1
activation=linear



### CONV4 - MBConv6 - 1 (3)
# dropout only before residual connection
[dropout]
probability=.3

# block_3_1
[shortcut]
from=-5
activation=linear

# conv_3_2_expand
[convolutional]
filters=176	#144
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_3_2_dwise
[convolutional]
groups=176	#144
filters=176	#144
size=5
pad=1
stride=2
batch_normalize=1
activation=relu6

# conv_3_2_linear
[convolutional]
filters=48	#40
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


### CONV4 - MBConv6 - 2 (3)
# conv_4_1_expand
[convolutional]
filters=232	#192
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_4_1_dwise
[convolutional]
groups=232	#192
filters=232	#192
size=5
stride=1
pad=1
batch_normalize=1
activation=relu6

# conv_4_1_linear
[convolutional]
filters=48	#40
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


### CONV4 - MBConv6 - 3 (3)
# dropout only before residual connection
[dropout]
probability=.3

# block_4_2
[shortcut]
from=-5
activation=linear

# conv_4_1_expand
[convolutional]
filters=232	#192
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_4_1_dwise
[convolutional]
groups=232	#192
filters=232	#192
size=5
stride=1
pad=1
batch_normalize=1
activation=relu6

# conv_4_1_linear
[convolutional]
filters=48	#40
size=1
stride=1
pad=0
batch_normalize=1
activation=linear




### CONV5 - MBConv6 - 1 (5)
# dropout only before residual connection
[dropout]
probability=.3

# block_4_2
[shortcut]
from=-5
activation=linear

# conv_4_3_expand
[convolutional]
filters=232	#192
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_4_3_dwise
[convolutional]
groups=232	#192
filters=232	#192
size=3
stride=1
pad=1
batch_normalize=1
activation=relu6

# conv_4_3_linear
[convolutional]
filters=96	#80
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


### CONV5 - MBConv6 - 2 (5)
# conv_4_4_expand
[convolutional]
filters=464	#384
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_4_4_dwise
[convolutional]
groups=464	#384
filters=464	#384
size=3
stride=1
pad=1
batch_normalize=1
activation=relu6

# conv_4_4_linear
[convolutional]
filters=96	#80
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


### CONV5 - MBConv6 - 3 (5)
# dropout only before residual connection
[dropout]
probability=.3

# block_4_4
[shortcut]
from=-5
activation=linear

# conv_4_5_expand
[convolutional]
filters=464	#384
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_4_5_dwise
[convolutional]
groups=464	#384
filters=464	#384
size=3
stride=1
pad=1
batch_normalize=1
activation=relu6

# conv_4_5_linear
[convolutional]
filters=96	#80
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


### CONV5 - MBConv6 - 4 (5)
# dropout only before residual connection
[dropout]
probability=.3

# block_4_4
[shortcut]
from=-5
activation=linear

# conv_4_5_expand
[convolutional]
filters=464	#384
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_4_5_dwise
[convolutional]
groups=464	#384
filters=464	#384
size=3
stride=1
pad=1
batch_normalize=1
activation=relu6

# conv_4_5_linear
[convolutional]
filters=96	#80
size=1
stride=1
pad=0
batch_normalize=1
activation=linear



### CONV5 - MBConv6 - 5 (5)
# dropout only before residual connection
[dropout]
probability=.3

# block_4_4
[shortcut]
from=-5
activation=linear

# conv_4_5_expand
[convolutional]
filters=464	#384
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_4_5_dwise
[convolutional]
groups=464	#384
filters=464	#384
size=3
stride=1
pad=1
batch_normalize=1
activation=relu6

# conv_4_5_linear
[convolutional]
filters=96	#80
size=1
stride=1
pad=0
batch_normalize=1
activation=linear



### CONV6 - MBConv6 - 1 (5)
# dropout only before residual connection
[dropout]
probability=.3

# block_4_6
[shortcut]
from=-5
activation=linear

# conv_4_7_expand
[convolutional]
filters=464	#384
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_4_7_dwise
[convolutional]
groups=464	#384
filters=464	#384
size=5
pad=1
stride=2
batch_normalize=1
activation=relu6

# conv_4_7_linear
[convolutional]
filters=136	#112
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


### CONV6 - MBConv6 - 2 (5)
# conv_5_1_expand
[convolutional]
filters=688	#576
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_5_1_dwise
[convolutional]
groups=688	#576
filters=688	#576
size=5
stride=1
pad=1
batch_normalize=1
activation=relu6

# conv_5_1_linear
[convolutional]
filters=136	#112
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


### CONV6 - MBConv6 - 3 (5)
# dropout only before residual connection
[dropout]
probability=.3

# block_5_1
[shortcut]
from=-5
activation=linear

# conv_5_2_expand
[convolutional]
filters=688	#576
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_5_2_dwise
[convolutional]
groups=688	#576
filters=688	#576
size=5
stride=1
pad=1
batch_normalize=1
activation=relu6

# conv_5_2_linear
[convolutional]
filters=136	#112
size=1
stride=1
pad=0
batch_normalize=1
activation=linear



### CONV6 - MBConv6 - 4 (5)
# dropout only before residual connection
[dropout]
probability=.3

# block_5_1
[shortcut]
from=-5
activation=linear

# conv_5_2_expand
[convolutional]
filters=688	#576
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_5_2_dwise
[convolutional]
groups=688	#576
filters=688	#576
size=5
stride=1
pad=1
batch_normalize=1
activation=relu6

# conv_5_2_linear
[convolutional]
filters=136	#112
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


### CONV6 - MBConv6 - 5 (5)
# dropout only before residual connection
[dropout]
probability=.3

# block_5_1
[shortcut]
from=-5
activation=linear

# conv_5_2_expand
[convolutional]
filters=688	#576
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_5_2_dwise
[convolutional]
groups=688	#576
filters=688	#576
size=5
stride=1
pad=1
batch_normalize=1
activation=relu6

# conv_5_2_linear
[convolutional]
filters=136	#112
size=1
stride=1
pad=0
batch_normalize=1
activation=linear



### CONV7 - MBConv6 - 1 (6)
# dropout only before residual connection
[dropout]
probability=.3

# block_5_2
[shortcut]
from=-5
activation=linear

# conv_5_3_expand
[convolutional]
filters=688	#576
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_5_3_dwise
[convolutional]
groups=688	#576
filters=688	#576
size=5
pad=1
stride=2
batch_normalize=1
activation=relu6


# conv_5_3_linear
[convolutional]
filters=232	#192
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


### CONV7 - MBConv6 - 2 (6)
# conv_6_1_expand
[convolutional]
filters=1152	#960
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_6_1_dwise
[convolutional]
groups=1152		#960
filters=1152	#960
size=5
stride=1
pad=1
batch_normalize=1
activation=relu6

# conv_6_1_linear
[convolutional]
filters=232	#192
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


### CONV7 - MBConv6 - 3 (6)
# dropout only before residual connection
[dropout]
probability=.3

# block_6_1
[shortcut]
from=-5
activation=linear

# conv_6_2_expand
[convolutional]
filters=1152	#960
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_6_2_dwise
[convolutional]
groups=1152	#960
filters=1152	#960
size=5
stride=1
pad=1
batch_normalize=1
activation=relu6

# conv_6_2_linear
[convolutional]
filters=232	#192
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


### CONV7 - MBConv6 - 4 (6)
# dropout only before residual connection
[dropout]
probability=.3

# block_6_1
[shortcut]
from=-5
activation=linear

# conv_6_2_expand
[convolutional]
filters=1152	#960
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_6_2_dwise
[convolutional]
groups=1152	#960
filters=1152	#960
size=5
stride=1
pad=1
batch_normalize=1
activation=relu6

# conv_6_2_linear
[convolutional]
filters=232	#192
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


### CONV7 - MBConv6 - 5 (6)
# dropout only before residual connection
[dropout]
probability=.3

# block_6_1
[shortcut]
from=-5
activation=linear

# conv_6_2_expand
[convolutional]
filters=1152	#960
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_6_2_dwise
[convolutional]
groups=1152	#960
filters=1152	#960
size=5
stride=1
pad=1
batch_normalize=1
activation=relu6

# conv_6_2_linear
[convolutional]
filters=232	#192
size=1
stride=1
pad=0
batch_normalize=1
activation=linear


### CONV7 - MBConv6 - 6 (6)
# dropout only before residual connection
[dropout]
probability=.3

# block_6_1
[shortcut]
from=-5
activation=linear

# conv_6_2_expand
[convolutional]
filters=1152	#960
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_6_2_dwise
[convolutional]
groups=1152	#960
filters=1152	#960
size=5
stride=1
pad=1
batch_normalize=1
activation=relu6



# conv_6_2_linear
[convolutional]
filters=232	#192
size=1
stride=1
pad=0
batch_normalize=1
activation=linear



### CONV8 - MBConv6 - 1 (1)
# dropout only before residual connection
[dropout]
probability=.3

# block_6_2
[shortcut]
from=-5
activation=linear

# conv_6_3_expand
[convolutional]
filters=1152	#960
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

# conv_6_3_dwise
[convolutional]
groups=1152	#960
filters=1152	#960
size=3
stride=1
pad=1
batch_normalize=1
activation=relu6



# conv_6_3_linear
[convolutional]
filters=384	#320
size=1
stride=1
pad=0
batch_normalize=1
activation=linear




### CONV9 - Conv2d 1x1
# conv_6_4
[convolutional]
filters=1536	#1280
size=1
stride=1
pad=0
batch_normalize=1
activation=relu6

###1/32#####
#decode layer only need change 
#1/16 and 1/8
##########################
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

### SPP ###
[maxpool]
stride=1
size=5

[route]
layers=-2

[maxpool]
stride=1
size=9

[route]
layers=-4

[maxpool]
stride=1
size=13

[route]
layers=-1,-3,-5,-6
### End SPP ###

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

#1/16 output as input 
[route]
layers = 81

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

#1/16 output as input
[route]
layers = -1, -3

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

#1/8
[upsample]
stride=2

[route]
layers = 57

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -1, -3

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

##########################

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=24
activation=linear

[yolo]
mask = 0,1,2
anchors = 11, 17,  11, 43,  29, 29,  22, 73,  52, 58,  41,138,  86,111, 111,201, 182,276
classes=3
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
scale_x_y = 1.2
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6
max_delta=5




[route]
layers = -4

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=256
activation=leaky

[route]
layers = -1, -16

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=24
activation=linear


[yolo]
mask = 3,4,5
anchors = 11, 17,  11, 43,  29, 29,  22, 73,  52, 58,  41,138,  86,111, 111,201, 182,276
classes=3
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
scale_x_y = 1.1
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6
max_delta=5


[route]
layers = -4

[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=512
activation=leaky

[route]
layers = -1, -37

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=24
activation=linear


[yolo]
mask = 6,7,8
anchors = 11, 17,  11, 43,  29, 29,  22, 73,  52, 58,  41,138,  86,111, 111,201, 182,276
classes=3
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1
scale_x_y = 1.05
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6
max_delta=5
